app/controllers/events_controller.rb

	def show
		@event = Event.find(params[:id])
		@ticket = current_user && current_user.tickets.find_by(event_id: params[:id])
		@tickets = @event.tickets.includes(:user).order(:created_at)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."user_id" = ? AND "tickets"."event_id" = ? LIMIT 1  [["user_id", 2], ["event_id", 6]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (2)

	def create
		@event = current_user.created_events.build(event_params)
---
INSERT INTO "events" ("name", "place", "event_image", "content", "start_time", "end_time", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

	def destroy
		@event = current_user.created_events.find(params[:id])
		@event.destroy!
---
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 4]]