app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("user_id", "event_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["event_id", 6], ["comment", ""], ["created_at", "2016-09-28 03:21:20.057396"], ["updated_at", "2016-09-28 03:21:20.057396"]]
---
	def create
		ticket = current_user.tickets.build do |t|
			t.event_id = params[:event_id]
			t.comment = params[:ticket][:comment]
		end
		if ticket.save