app/controllers/welcome_controller.rb

SELECT  "events".* FROM "events" WHERE ("events"."start_time" >= '2016-09-29 01:33:58.949473')  ORDER BY "events"."start_time" ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "events" WHERE ("events"."start_time" >= '2016-09-29 01:33:58.949473')
---
  def index
  	@q = Event.page(params[:page]).per(PER).order(:start_time).search(search_params)